In [13]:
import numpy as np
import pandas as pd

In [14]:

d = { 'Ism': ['Ali', 'Laylo', "Bobur", 'Zebo', 'Aziza'],
     'Yosh': [30, 28, 35, 40, 25],
     'Maosh': [5000, 6000, 4000, 7000, 5200],
     'Departament': ['IT', 'Marketing', 'HR', 'IT', 'Marketing']
}

df = pd.DataFrame(d)
df

     Ism  Yosh  Maosh Departament
0    Ali    30   5000          IT
1  Laylo    28   6000   Marketing
2  Bobur    35   4000          HR
3   Zebo    40   7000          IT
4  Aziza    25   5200   Marketing

In [15]:
df.sort_values(by='Yosh')

     Ism  Yosh  Maosh Departament
4  Aziza    25   5200   Marketing
1  Laylo    28   6000   Marketing
0    Ali    30   5000          IT
2  Bobur    35   4000          HR
3   Zebo    40   7000          IT

In [16]:
maosh_5000 = df[df['Maosh']>5000]
maosh_5000

     Ism  Yosh  Maosh Departament
1  Laylo    28   6000   Marketing
3   Zebo    40   7000          IT
4  Aziza    25   5200   Marketing

In [20]:
print(df)
df_g = df.groupby('Departament')['Maosh'].mean()

print(df_g)

     Ism  Yosh  Maosh Departament
0    Ali    30   5000          IT
1  Laylo    28   6000   Marketing
2  Bobur    35   4000          HR
3   Zebo    40   7000          IT
4  Aziza    25   5200   Marketing
Departament
HR           4000.0
IT           6000.0
Marketing    5600.0
Name: Maosh, dtype: float64